Repository: Eptagone/SauceNAObot
Catalog: src/SauceNao.Core/Resources/BotMessages.*.resx
Languages: es

# About
source: This bot provides you with an interface to use <a href="https://saucenao.com/">SauceNAO</a>'s reverse image search engine. Send me an image (image, GIF or a sticker) and I'll try to reverse search using the SauceNAO API. This bot was created by a third party to use SauceNAO on Telegram. The project has not any affiliation with Xamayon (the creator of SauceNAO).
es: Este bot le proporciona una interfaz para utilizar el motor de búsqueda de imágenes inversas de <a href="https://saucenao.com/">SauceNAO</a>. Envíame una imagen (imagen, GIF o un sticker) e intentaré realizar la búsqueda inversa usando la API de SauceNAO. Este bot fue creado por un tercero para usar SauceNAO en Telegram. El proyecto no tiene ninguna afiliación con Xamayon (el creador de SauceNAO).

# Anticheats
source: Use this feature to block the reverse search of images sent by specific bots in your group chats. To add a bot to AntiCheat list, just reply to a message sent by the bot with <code>/anticheats add</code>. To remove the bot, reply to the message with <code>/anticheats remove </code>.
es: Usa esta función para bloquear la búsqueda inversa de imágenes enviadas por bots específicos en tus chats grupales. Para añadir un bot a la lista responda a un mensaje enviado por el bot con <code>/anticheats add</code>. Para remover un bot de la lista responda a un mensaje enviado por el bot con <code>/anticheats remove</code>.

# AnticheatsAdded
source: Bot @{0} was added to the AntiCheats list.
es: El bot @{0} fue agregado a la lista de Anti-Trampas.

# AnticheatsAlreadyExists
source: Bot @{0} already exists in AntiCheats list.
es: El bot @{0} ya existe en la lista de Anti-Trampas.

# AnticheatsDeleted
source: Bot @{0} was removed from the AntiCheats list.
es: El bot @{0} fue removido de la lista de Anti-Trampas.

# AnticheatsDoesNotExist
source: Bot @{0} doesn't exist in the AntiCheats list.
es: El bot @{0} no existe en la lista Anti-Trampas.

# AnticheatsMessage
source: Ups, no cheating, my friend.
es: Ups, sin trampas, mi amig@.

# AntiCheatsNotABot
source: The target user isn't a bot.
es: El usuario objetivo no es un bot.

# ApiKey
source: If you're already supporting <a href="https://www.patreon.com/saucenao">Xamayon</a> (the original creator of saucenao.com), then you can configure the bot to use your own API key to get your sauces instead of using shared API keys. <code>/apikey status</code> - Check the status of your saved api key. <code>/apikey set &lt;your api key&gt;</code> - Save your API Plus key. Don't use free API keys or it will cause problems for you. <code>/apikey delete</code> - Delete your saved api key.
es: Si usted ya está apoyando a <a href="https://www.patreon.com/saucenao">Xamayon</a> (el creador original de saucenao.com), entonces usted puede configurar el bot para que utilice su propia clave de API para obtener sus salsas en vez de usar claves de API compartidas. <code>/apikey status</code> - Verifica el estado de tu clave de api guardada. <code>/apikey set &lt;your api key&gt</code>; - Guarda tu clave de API Plus. No utilice claves de API gratuitas o le generara problemas. <code>/apikey delete</code> - Elimina tu clave de api guardada.

# ApiKeyDeleted
source: The saved api key has been deleted.
es: Se ha borrado la clave de api guardada.

# ApiKeyNew
source: Done! The Bot will use your API key from now on. To delete it, use <i>/apikey delete</i>.
es: ¡Hecho! El Bot usará su clave API a partir de ahora. Para eliminarlo, use <i>/apikey delete</i>.

# ApiKeyNone
source: There is no api key configured.
es: No hay ninguna clave api configurada.

# ApiKeyStatus
source: <b>Bot is configured to use the follow api key:</b> {0}
es: <b>El bot está configurado para usar la siguiente clave api:</b> {0}

# Busy
source: SauceNao is very busy right now. Please try again later or try using /temp command. If this message appears frequently, please check the <a href="{0}">support chat</a>.
es: SauceNao está algo saturado en este momento. Por favor, inténtelo de nuevo más tarde o pruebe usando el comando /temp. Si este mensaje aparece con frecuencia, consulte el <a href="{0}">chat de soporte</a>.

# BusyPolling
source: SauceNao is very busy right now. Please try again later. If this message appears frequently, please check the <a href="{0}">support chat</a>.
es: SauceNao está algo saturado en este momento. Por favor, inténtelo de nuevo más tarde. Si este mensaje aparece con frecuencia, consulte el <a href="{0}">chat de soporte</a>.

# BuyMeACookie
source: Your contributions are used to pay for the bot's hosting and the shared account that we use to search for your sauces. If you have any other questions, ask in the support chat. - <a href="https://www.buymeacoffee.com/eptagone">Buy me a cookie!</a> - <b>Bitcoin:</b> <a href="bitcoin:BC1Q0W43TPRJN80ZN248K7XLZTU7LVHKZGY6DAK8MT?label=MyCoffe&message=Invite%20me%20for%20a%20coffee">bc1q0w43tprjn80zn248k7xlztu7lvhkzgy6dak8mt</a> - <b>Toncoin:</b> <a href="ton://transfer/EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY">EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY</a> Note: Please be sure to confirm the amount you will donate. We don't make refunds.
es: Sus aportaciones son utilizadas para pagar el alojamiento del bot y la cuenta compartida que usamos para buscar tus salsas. Si tiene alguna otra pregunta, consulte en el chat de soporte. - <a href="https://www.buymeacoffee.com/eptagone">Buy me a cookie!</a> - <b>Bitcoin:</b> <a href="bitcoin:BC1Q0W43TPRJN80ZN248K7XLZTU7LVHKZGY6DAK8MT?label=MyCoffe&message=Invite%20me%20for%20a%20coffee">bc1q0w43tprjn80zn248k7xlztu7lvhkzgy6dak8mt</a> - <b>Toncoin:</b> <a href="ton://transfer/EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY">EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY</a> Nota: asegúrese de confirmar la cantidad que donará. No hacemos devoluciones.

# Creator
source: My creator is <a href="tg://user?id=418909573">Derek Nieves</a>.
es: Mi creador es <a href="tg://user?id=418909573">Derek Nieves</a>.

# EmptyRequest
source: You need to reply to an image file (image, GIF or a sticker)
es: Usted necesita responder a un archivo de imagen (imagen, GIF o un STICKER)

# FailedConvertFile
source: Failed to convert file to a supported file.
es: No se pudo convertir el archivo a un archivo compatible.

# GeneratingTmpUrl
source: Generating temporary link...
es: Generando enlace temporal...

# GroupsOnly
source: This command only works in group chats.
es: Este comando sólo funciona en chats grupales.

# Help
source: Send me an image file (image, GIF or a sticker) to find it's sauce right now. (source) <i>If I'm in a group, reply to an image with /sauce </i>. Forward the media files you have searched along with their sauce via bot. More Info: <code>/help MyHistory</code>. Use my Anti-Cheat feature in your groups when playing "Guess the Character". More Info: <code>/help AntiCheats</code>
es: Envíeme un archivo de imagen (imagen, GIF o un sticker) para encontrar su salsa ahora mismo. (su fuente de origen) <i>Si estoy en un grupo, responda a una imagen con /salsa</i>. Reenvía los archivos multimedia que has buscado junto con su salsa via bot. Mas Info: <code>/help MyHistory</code>. Usa mi característica Anti-Trampas en tus grupos cuando juegues a "Adivina el Personaje". Mas Info: <code>/help AntiCheats </code>

# History
source: You can send images with sauce from your recent history via bot. The history will be erased periodically. If you want to delete your history right now, type <code> /history clear</code>.
es: Puede enviar imágenes con su salsa de su historial reciente vía bot. El historial se borrará periódicamente. Si desea eliminar su historial ahora mismo, escriba <code>/history clear</code>.

# HistoryButton
source: View search history
es: Ver historial de búsqueda

# HistoryErased
source: Your history has been erased. Inline search results can take a few minutes to disappear because they are cached.
es: Tu historial ha sido borrado. Los resultados de la búsqueda Inline pueden tardar unos minutos en desaparecer porque están almacenados en caché.

# HistoryNone
source: This seems somewhat empty. Try to find some sauces.
es: Esto parece algo vacío. Intenta encontrar algunas salsas.

# InvalidPhoto
source: That doesn't look like a photo file.
es: Eso no parece un archivo de imagen.

# LocalMode
source: Bot is currently running in local mode, so this feature is disabled.
es: El bot se está ejecutando actualmente en modo local, por lo que esta función está deshabilitada.

# LocalModeFile
source: This file cannot be processed at this time, the bot is running in local mode. Some files need to be uploaded as temporary files, but this feature is not available in local mode.
es: Este archivo no se puede procesar en este momento, el bot se está ejecutando en modo local. Algunos archivos deben cargarse como archivos temporales, pero esta función no está disponible en modo local.

# MissingParams
source: You have not specified sufficient parameters to use this function.
es: No ha especificado parámetros suficientes para utilizar esta función.

# NotFound
source: No sauce found. Maybe try <a href="{0}">Google Reverse Search</a> or <a href="{1}">Yandex</a> instead? or see on <a href="{2}">SauceNAO website</a> to see all the results.
es: No se encontraron resultados. ¿Quizás desee intentar la <a href="{0}">Busqueda Inversa de Google</a> o <a href="{1}">Yandex</a> en su lugar? o ver en el sitio web de <a href="{2}">SauceNAO</a> para ver todos los resultados.

# NotFoundLocalMode
source: No sauce found. Alternate links are not available as the bot is running in local mode.
es: No se encontraron resultados. Los enlaces alternativos no están disponibles ya que el bot se ejecuta en modo local.

# PrivateChatsOnly
source: This command only works in private chats.
es: Este comando sólo funciona en chats privados.

# ResultCharacter
source: Character
es: Personaje

# ResultCharacters
source: Characters
es: Personajes

# ResultCreator
source: Creator
es: Creador

# ResultPart
source: Part
es: Parte

# ResultTime
source: Time
es: Tiempo

# ResultYear
source: Year
es: Año

source: Searching...
es: Buscando...

# SetLang
source: Use this command to change the reply language in the current chat. Not all languages are available. <b>Syntax:</b> <code>/setlang &lt;language code&gt; [-Force]</code> Specify the optional [-Force] parameter to keep your language in any group regardless of the group's language.
es: Utilice este comando para cambiar el idioma de respuesta en el chat actual. No todos los idiomas están disponibles. <b>Sintaxis:</b> <code>/setlang &lt;código de idioma&gt; [-Force]</code> Especifique el parámetro opcional [-Force] para mantener su idioma en cualquier grupo, independientemente del idioma del grupo.

# SetLangSaved
source: Your language preferences have been saved.
es: Se han guardado sus preferencias de idioma.

source: Source
es: Fuente

# Statistics
source: <b>Usage Statistics</b> {0} successful searches in the last 20 days. Used by {1} users. Used by {2} groups.
es: <b>Estadísticas de uso</b> {0} búsquedas exitosas en los últimos 20 días. Utilizado por {1} usuarios. Utilizado por {2} grupos.

source: Support Chat
es: Chat de Soporte

# TemporalUrlDone
source: Done! Check your <a href="{0}">temp url</a>.
es: ¡Hecho! Prueba tu <a href="{0}">enlace temporal</a>.

# TooBigFile
source: The search could not be performed. The file size is too large.
es: No se ha podido realizar la búsqueda. El tamaño del archivo es demasiado grande.
